<a href="https://colab.research.google.com/github/raghav5102/ML-prediction-models/blob/main/Ecomerce.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

SELLING PRICE OF PRODUCTS USING RANDOM FOREST REGRESSOR,FEATURE IMPORTANCE,LABEL ENCODING

In [ ]:
import numpy as np 
import pandas as pd

In [ ]:
df=pd.read_csv('Train.csv')
df.head()

  Product Product_Brand  ...        Date Selling_Price
0  P-2610         B-659  ...    2/3/2017         291.0
1  P-2453        B-3078  ...    7/1/2015         897.0
2  P-6802        B-1810  ...   1/12/2019         792.0
3  P-4452        B-3078  ...  12/12/2014         837.0
4  P-8454        B-3078  ...  12/12/2013         470.0

[5 rows x 8 columns]

In [ ]:
dft=pd.read_csv('Test.csv')
dft.head()

   Product Product_Brand Item_Category  ... Subcategory_2 Item_Rating        Date
0  P-11284        B-2984     computers  ...       routers         4.3   1/12/2018
1   P-6580        B-1732     jewellery  ...     bracelets         3.0  20/12/2012
2   P-5843        B-3078      clothing  ...  western wear         1.5   1/12/2014
3   P-5334        B-1421     jewellery  ...     necklaces         3.9   1/12/2019
4   P-5586        B-3078      clothing  ...  western wear         1.4   1/12/2017

[5 rows x 7 columns]

In [ ]:
df.dtypes

Product           object
Product_Brand     object
Item_Category     object
Subcategory_1     object
Subcategory_2     object
Item_Rating      float64
Date              object
Selling_Price    float64
dtype: object

In [ ]:
df['Date']=df['Date'].str.replace("/","").astype(int)

In [ ]:
df.head()

  Product Product_Brand  ...      Date Selling_Price
0  P-2610         B-659  ...    232017         291.0
1  P-2453        B-3078  ...    712015         897.0
2  P-6802        B-1810  ...   1122019         792.0
3  P-4452        B-3078  ...  12122014         837.0
4  P-8454        B-3078  ...  12122013         470.0

[5 rows x 8 columns]

In [ ]:
dft['Date']=dft['Date'].str.replace("/","").astype(int)
dft.head()

   Product Product_Brand Item_Category  ... Subcategory_2 Item_Rating      Date
0  P-11284        B-2984     computers  ...       routers         4.3   1122018
1   P-6580        B-1732     jewellery  ...     bracelets         3.0  20122012
2   P-5843        B-3078      clothing  ...  western wear         1.5   1122014
3   P-5334        B-1421     jewellery  ...     necklaces         3.9   1122019
4   P-5586        B-3078      clothing  ...  western wear         1.4   1122017

[5 rows x 7 columns]

In [ ]:
y_train=df['Selling_Price']
X_train=df.drop('Selling_Price',axis=1)

In [ ]:
X_test=dft.drop('Product',axis=1)
X_train=X_train.drop('Product',axis=1)

In [ ]:
X_train.head()

  Product_Brand             Item_Category  ... Item_Rating      Date
0         B-659        bags wallets belts  ...         4.3    232017
1        B-3078                  clothing  ...         3.1    712015
2        B-1810  home decor festive needs  ...         3.5   1122019
3        B-3078  beauty and personal care  ...         4.0  12122014
4        B-3078                  clothing  ...         4.3  12122013

[5 rows x 6 columns]

In [ ]:
X_test.head()

  Product_Brand Item_Category  ... Item_Rating      Date
0        B-2984     computers  ...         4.3   1122018
1        B-1732     jewellery  ...         3.0  20122012
2        B-3078      clothing  ...         1.5   1122014
3        B-1421     jewellery  ...         3.9   1122019
4        B-3078      clothing  ...         1.4   1122017

[5 rows x 6 columns]

In [ ]:
X_train=X_train.fillna(method='pad')
X_test=X_test.fillna(method='pad')

In [ ]:
def unique_items(list1, list2):
  a = list1
  b = list2
  a.extend(b)
  return list(set(a))

In [ ]:
from sklearn.preprocessing import LabelEncoder
from sklearn.exceptions import NotFittedError

le_brand = LabelEncoder()
all_brand = unique_items(list(X_train['Product_Brand']),list(X_test['Product_Brand']))
le_brand.fit(all_brand)

le_item= LabelEncoder()
all_item = unique_items(list(X_train['Item_Category']),list(X_test['Item_Category']))
le_item.fit(all_item)

le_sub1 = LabelEncoder()
all_sub1 = unique_items(list(X_train['Subcategory_1']),list(X_test['Subcategory_1']))
le_sub1.fit(all_sub1)

le_sub2 = LabelEncoder()
all_sub2 = unique_items(list(X_train['Subcategory_2']),list(X_test['Subcategory_2']))
le_sub2.fit(all_sub2)

LabelEncoder()

In [ ]:
X_train['Product_Brand'] = le_brand.transform(X_train['Product_Brand'])

X_train['Item_Category'] = le_item.transform(X_train['Item_Category'])

X_train['Subcategory_1'] = le_sub1.transform(X_train['Subcategory_1'])

X_train['Subcategory_2'] = le_sub2.transform(X_train['Subcategory_2'])

In [ ]:
X_train.head()

   Product_Brand  Item_Category  ...  Item_Rating      Date
0           1130              9  ...          4.3    232017
1            877             17  ...          3.1    712015
2            369             38  ...          3.5   1122019
3            877             12  ...          4.0  12122014
4            877             17  ...          4.3  12122013

[5 rows x 6 columns]

In [ ]:
X_test['Product_Brand'] = le_brand.transform(X_test['Product_Brand'])

X_test['Item_Category'] = le_item.transform(X_test['Item_Category'])

X_test['Subcategory_1'] = le_sub1.transform(X_test['Subcategory_1'])

X_test['Subcategory_2'] = le_sub2.transform(X_test['Subcategory_2'])

In [ ]:
X_test.head()

   Product_Brand  Item_Category  ...  Item_Rating      Date
0            842             20  ...          4.3   1122018
1            335             44  ...          3.0  20122012
2            877             17  ...          1.5   1122014
3            203             44  ...          3.9   1122019
4            877             17  ...          1.4   1122017

[5 rows x 6 columns]

In [ ]:
from sklearn.ensemble import RandomForestRegressor

In [ ]:
clf=RandomForestRegressor(n_estimators=3000)

In [ ]:
clf.fit(X_train,y_train)

RandomForestRegressor(bootstrap=True, ccp_alpha=0.0, criterion='mse',
                      max_depth=None, max_features='auto', max_leaf_nodes=None,
                      max_samples=None, min_impurity_decrease=0.0,
                      min_impurity_split=None, min_samples_leaf=1,
                      min_samples_split=2, min_weight_fraction_leaf=0.0,
                      n_estimators=5000, n_jobs=None, oob_score=False,
                      random_state=None, verbose=0, warm_start=False)

In [ ]:
clf.feature_importances_

array([0.20162675, 0.05150686, 0.04701475, 0.3022056 , 0.04427455,
       0.35337149])

In [ ]:
y_test=clf.predict(X_test)

In [ ]:
dft['Selling_Price']=y_test

In [ ]:
dft.head()

   Product Product_Brand Item_Category  ... Item_Rating      Date  Selling_Price
0  P-11284        B-2984     computers  ...         4.3   1122018    3491.270701
1   P-6580        B-1732     jewellery  ...         3.0  20122012     423.392600
2   P-5843        B-3078      clothing  ...         1.5   1122014     896.324864
3   P-5334        B-1421     jewellery  ...         3.9   1122019     384.676600
4   P-5586        B-3078      clothing  ...         1.4   1122017     785.503820

[5 rows x 8 columns]

In [ ]:
res=pd.DataFrame(y_test)

In [ ]:
res

                0
0     3491.270701
1      423.392600
2      896.324864
3      384.676600
4      785.503820
...           ...
1046  1855.865800
1047   252.538600
1048  1530.859190
1049   998.473400
1050  1492.703857

[1051 rows x 1 columns]

In [ ]:
res.to_csv('Ecom.csv',index=False)
!cp Ecom.csv "drive/My Drive/"

In [ ]:
def rf_feat_importance(m, df):
    return pd.DataFrame({'cols':df.columns, 'imp':m.feature_importances_}
                       ).sort_values('imp', ascending=False)
fi = rf_feat_importance(clf, X_train); 
fi

            cols       imp
1  Subcategory_2  0.371450
2           Date  0.334913
0  Product_Brand  0.293637

In [ ]:
X_train.head()

   Product_Brand  Item_Category  ...  Item_Rating      Date
0           1130              9  ...          4.3    232017
1            877             17  ...          3.1    712015
2            369             38  ...          3.5   1122019
3            877             12  ...          4.0  12122014
4            877             17  ...          4.3  12122013

[5 rows x 6 columns]

In [ ]:
X_test.head()

   Product_Brand  Item_Category  ...  Item_Rating      Date
0            842             20  ...          4.3   1122018
1            335             44  ...          3.0  20122012
2            877             17  ...          1.5   1122014
3            203             44  ...          3.9   1122019
4            877             17  ...          1.4   1122017

[5 rows x 6 columns]

In [ ]:
y_train

0        291.0
1        897.0
2        792.0
3        837.0
4        470.0
         ...
2447     741.0
2448    1590.0
2449     995.0
2450    1598.0
2451     397.0
Name: Selling_Price, Length: 2452, dtype: float64

In [ ]:
to_drop=['Item_Category','Subcategory_1','Item_Rating']

In [ ]:
X_train=X_train.drop(to_drop,axis=1)
X_test=X_test.drop(to_drop,axis=1)

In [ ]:
X_train.head()

   Product_Brand  Subcategory_2      Date
0           1130            159    232017
1            877            387    712015
2            369            118   1122019
3            877            155  12122014
4            877            344  12122013

In [ ]:
X_test.head()

   Product_Brand  Subcategory_2      Date
0            842            298   1122018
1            335             53  20122012
2            877            387   1122014
3            203            243   1122019
4            877            387   1122017

In [ ]:
clf.fit(X_train,y_train)

RandomForestRegressor(bootstrap=True, ccp_alpha=0.0, criterion='mse',
                      max_depth=None, max_features='auto', max_leaf_nodes=None,
                      max_samples=None, min_impurity_decrease=0.0,
                      min_impurity_split=None, min_samples_leaf=1,
                      min_samples_split=2, min_weight_fraction_leaf=0.0,
                      n_estimators=3000, n_jobs=None, oob_score=False,
                      random_state=None, verbose=0, warm_start=False)

In [ ]:
y_test=clf.predict(X_test)

In [ ]:
dft.head()

   Product Product_Brand Item_Category  ... Subcategory_2 Item_Rating      Date
0  P-11284        B-2984     computers  ...       routers         4.3   1122018
1   P-6580        B-1732     jewellery  ...     bracelets         3.0  20122012
2   P-5843        B-3078      clothing  ...  western wear         1.5   1122014
3   P-5334        B-1421     jewellery  ...     necklaces         3.9   1122019
4   P-5586        B-3078      clothing  ...  western wear         1.4   1122017

[5 rows x 7 columns]

In [ ]:
dft['Selling_Price']=y_test

In [ ]:
dft.head()

   Product Product_Brand Item_Category  ... Item_Rating      Date  Selling_Price
0  P-11284        B-2984     computers  ...         4.3   1122018    2315.752661
1   P-6580        B-1732     jewellery  ...         3.0  20122012     439.357000
2   P-5843        B-3078      clothing  ...         1.5   1122014     814.728395
3   P-5334        B-1421     jewellery  ...         3.9   1122019     473.415493
4   P-5586        B-3078      clothing  ...         1.4   1122017     802.493360

[5 rows x 8 columns]

In [ ]:
res=pd.DataFrame(y_test)

In [ ]:
res

                0
0     2315.752661
1      439.357000
2      814.728395
3      473.415493
4      802.493360
...           ...
1046  1189.063640
1047   234.244904
1048  1480.237659
1049  1646.372678
1050  1430.353474

[1051 rows x 1 columns]

In [ ]:
res.to_csv('Ecom.csv',index=False)
!cp Ecom.csv "drive/My Drive/"

In [ ]:
from sklearn.ensemble import GradientBoostingRegressor

In [ ]:
clfd=GradientBoostingRegressor(n_estimators=1000)

In [ ]:
clfd.fit(X_train,y_train)

GradientBoostingRegressor(alpha=0.9, ccp_alpha=0.0, criterion='friedman_mse',
                          init=None, learning_rate=0.1, loss='ls', max_depth=3,
                          max_features=None, max_leaf_nodes=None,
                          min_impurity_decrease=0.0, min_impurity_split=None,
                          min_samples_leaf=1, min_samples_split=2,
                          min_weight_fraction_leaf=0.0, n_estimators=1000,
                          n_iter_no_change=None, presort='deprecated',
                          random_state=None, subsample=1.0, tol=0.0001,
                          validation_fraction=0.1, verbose=0, warm_start=False)

In [ ]:
y_test=clfd.predict(X_test)

In [ ]:
for i in y_test:
  if(i<0):
    i=i*(-1)
  else:
    continue

In [ ]:
dft['Selling_Price']=y_test

In [ ]:
for i in dft['Selling_Price']:
  if(i<0):
    i=i*(-1)
  else:
    continue

In [ ]:
res=pd.DataFrame(y_test)

In [ ]:
res

                0
0     3262.744801
1     1304.127353
2      785.056242
3       66.768900
4      788.657464
...           ...
1046  1600.448261
1047   432.956999
1048  1311.900664
1049   173.424397
1050  1306.986904

[1051 rows x 1 columns]

In [ ]:
def rf_feat_importance(m, df):
    return pd.DataFrame({'cols':df.columns, 'imp':m.feature_importances_}
                       ).sort_values('imp', ascending=False)
fi = rf_feat_importance(clfd, X_train); 
fi

            cols       imp
5           Date  0.346881
3  Subcategory_2  0.271516
2  Subcategory_1  0.150506
0  Product_Brand  0.142833
1  Item_Category  0.068248
4    Item_Rating  0.020016

In [ ]:
res.to_csv('Ecom.csv',index=False)
!cp Ecom.csv "drive/My Drive/"